app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jules"], ["password_digest", "$2a$12$hO2qiZFbojfpgjv0kpRjBumHjB3B/mO0HTKuRO8z3sIwGI9hP7TO6"], ["created_at", "2022-02-13 22:22:32.668521"], ["updated_at", "2022-02-13 22:22:32.668521"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save